spec/cassettes/Payment/_ensure_payment_isnt_over_balance/does_not_include_failed_payments.yml

---
http_interactions:
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts
    body:
      encoding: UTF-8
      string: '{"account_number":"9900000002","account_type":"checking","name":"Johann
        Bernoulli","routing_number":"021000021"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Access-Control-Allow-Headers:
      - Content-Type
      Access-Control-Allow-Methods:
      - POST, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Content-Type:
      - application/json
      Date:
      - Tue, 16 Dec 2014 20:18:19 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMacdfbefc856011e4a13102a1fe52a36c
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.12.16
      X-Midlr-Version:
      - '2'
      X-Newrelic-App-Data:
      - PxQFWFNXCQYTUllWAgAAU0YdFhE1AwE2QgNWEVlbQFtcCxYxSBVbDQoZVA4IF0pcXAgEEBhTVggPbldQAQkWDEQRFgFKXVVGVkcVQQFNE1JKAgNTUlQJCghVUVYPBA9SSBEEAVRKQ0AAUlkECVoHBgFWW1YBWQEGRhoXBwcPS1Zt
      Content-Length:
      - '1373'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": null
              },
              "can_credit": true,
              "created_at": "2014-12-16T20:19:59.790325Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-12-16T20:19:59.790327Z",
              "href": "/bank_accounts/BA5gCNnzKncydBMO99yCodgh",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BA5gCNnzKncydBMO99yCodgh"
            }
          ],
          "links": {
            "bank_accounts.settlements": "/bank_accounts/{bank_accounts.id}/settlements",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications"
          }
        }
    http_version: 
  recorded_at: Tue, 16 Dec 2014 20:18:20 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA5gCNnzKncydBMO99yCodgh
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 16 Dec 2014 20:18:20 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMad5e79fe856011e49dde06429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.12.16
      Content-Length:
      - '510'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": null
              },
              "can_credit": true,
              "created_at": "2014-12-16T20:19:59.790325Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-12-16T20:19:59.790327Z",
              "href": "/bank_accounts/BA5gCNnzKncydBMO99yCodgh",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BA5gCNnzKncydBMO99yCodgh"
            }
          ],
          "links": {
            "bank_accounts.settlements": "/bank_accounts/{bank_accounts.id}/settlements",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications"
          }
        }
    http_version: 
  recorded_at: Tue, 16 Dec 2014 20:18:20 GMT
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA5gCNnzKncydBMO99yCodgh/verifications
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 16 Dec 2014 20:18:27 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMad93febc856011e49c920230f00c9248
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.12.16
      Content-Length:
      - '599'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "pending",
              "links": {
                "bank_account": "BA5gCNnzKncydBMO99yCodgh"
              },
              "href": "/verifications/BZ5oWzFEBCWbfvV8zPBXQ1nW",
              "created_at": "2014-12-16T20:20:07.187075Z",
              "attempts_remaining": 3,
              "updated_at": "2014-12-16T20:20:07.607324Z",
              "deposit_status": "succeeded",
              "attempts": 0,
              "meta": {},
              "id": "BZ5oWzFEBCWbfvV8zPBXQ1nW"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Tue, 16 Dec 2014 20:18:28 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA5gCNnzKncydBMO99yCodgh
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 16 Dec 2014 20:18:28 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMb24e90c0856011e4adbd02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.12.16
      Content-Length:
      - '537'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": "BZ5oWzFEBCWbfvV8zPBXQ1nW"
              },
              "can_credit": true,
              "created_at": "2014-12-16T20:19:59.790325Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-12-16T20:19:59.790327Z",
              "href": "/bank_accounts/BA5gCNnzKncydBMO99yCodgh",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BA5gCNnzKncydBMO99yCodgh"
            }
          ],
          "links": {
            "bank_accounts.settlements": "/bank_accounts/{bank_accounts.id}/settlements",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications"
          }
        }
    http_version: 
  recorded_at: Tue, 16 Dec 2014 20:18:28 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA5gCNnzKncydBMO99yCodgh
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 16 Dec 2014 20:18:28 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMb283af9e856011e48c5306429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.12.16
      Content-Length:
      - '537'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": "BZ5oWzFEBCWbfvV8zPBXQ1nW"
              },
              "can_credit": true,
              "created_at": "2014-12-16T20:19:59.790325Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-12-16T20:19:59.790327Z",
              "href": "/bank_accounts/BA5gCNnzKncydBMO99yCodgh",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BA5gCNnzKncydBMO99yCodgh"
            }
          ],
          "links": {
            "bank_accounts.settlements": "/bank_accounts/{bank_accounts.id}/settlements",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications"
          }
        }
    http_version: 
  recorded_at: Tue, 16 Dec 2014 20:18:29 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/verifications/BZ5oWzFEBCWbfvV8zPBXQ1nW
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 16 Dec 2014 20:18:29 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMb2b58104856011e49dde06429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.12.16
      Content-Length:
      - '599'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "pending",
              "links": {
                "bank_account": "BA5gCNnzKncydBMO99yCodgh"
              },
              "href": "/verifications/BZ5oWzFEBCWbfvV8zPBXQ1nW",
              "created_at": "2014-12-16T20:20:07.187075Z",
              "attempts_remaining": 3,
              "updated_at": "2014-12-16T20:20:07.607324Z",
              "deposit_status": "succeeded",
              "attempts": 0,
              "meta": {},
              "id": "BZ5oWzFEBCWbfvV8zPBXQ1nW"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Tue, 16 Dec 2014 20:18:29 GMT
- request:
    method: put
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/verifications/BZ5oWzFEBCWbfvV8zPBXQ1nW
    body:
      encoding: UTF-8
      string: '{"verification_status":"pending","links":{"bank_account":"BA5gCNnzKncydBMO99yCodgh"},"created_at":"2014-12-16T20:20:07.187075Z","attempts_remaining":3,"updated_at":"2014-12-16T20:20:07.607324Z","deposit_status":"succeeded","attempts":0,"meta":{},"id":"BZ5oWzFEBCWbfvV8zPBXQ1nW","amount_1":"1","amount_2":"1"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 16 Dec 2014 20:18:29 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMb2e696fe856011e4940e0230f00c9248
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.12.16
      Content-Length:
      - '601'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "succeeded",
              "links": {
                "bank_account": "BA5gCNnzKncydBMO99yCodgh"
              },
              "href": "/verifications/BZ5oWzFEBCWbfvV8zPBXQ1nW",
              "created_at": "2014-12-16T20:20:07.187075Z",
              "attempts_remaining": 2,
              "updated_at": "2014-12-16T20:20:09.592066Z",
              "deposit_status": "succeeded",
              "attempts": 1,
              "meta": {},
              "id": "BZ5oWzFEBCWbfvV8zPBXQ1nW"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Tue, 16 Dec 2014 20:18:29 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA5gCNnzKncydBMO99yCodgh
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 16 Dec 2014 20:18:29 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMb3224e4c856011e49dde06429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.12.16
      Content-Length:
      - '539'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": "BZ5oWzFEBCWbfvV8zPBXQ1nW"
              },
              "can_credit": true,
              "created_at": "2014-12-16T20:19:59.790325Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-12-16T20:20:09.589822Z",
              "href": "/bank_accounts/BA5gCNnzKncydBMO99yCodgh",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": true,
              "id": "BA5gCNnzKncydBMO99yCodgh"
            }
          ],
          "links": {
            "bank_accounts.settlements": "/bank_accounts/{bank_accounts.id}/settlements",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications"
          }
        }
    http_version: 
  recorded_at: Tue, 16 Dec 2014 20:18:30 GMT
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA5gCNnzKncydBMO99yCodgh/debits
    body:
      encoding: UTF-8
      string: '{"amount":500000,"appears_on_statement_as":"Epicodus tuition"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 16 Dec 2014 20:18:30 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMb353d6f6856011e48c5306429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.12.16
      Content-Length:
      - '1064'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "debits": [
            {
              "status": "succeeded",
              "description": null,
              "links": {
                "customer": null,
                "source": "BA5gCNnzKncydBMO99yCodgh",
                "card_hold": null,
                "order": null,
                "dispute": null
              },
              "updated_at": "2014-12-16T20:20:10.908943Z",
              "created_at": "2014-12-16T20:20:10.414544Z",
              "transaction_number": "WL3T-C5A-0KLR",
              "failure_reason": null,
              "currency": "USD",
              "amount": 500000,
              "failure_reason_code": null,
              "meta": {},
              "href": "/debits/WD5szuNKlA7uw4ivHpEPLJXa",
              "appears_on_statement_as": "BAL*Epicodus tuition",
              "id": "WD5szuNKlA7uw4ivHpEPLJXa"
            }
          ],
          "links": {
            "debits.customer": "/customers/{debits.customer}",
            "debits.order": "/orders/{debits.order}",
            "debits.dispute": "/disputes/{debits.dispute}",
            "debits.source": "/resources/{debits.source}",
            "debits.events": "/debits/{debits.id}/events",
            "debits.refunds": "/debits/{debits.id}/refunds",
            "debits.card_hold": "/holds/{debits.card_hold}"
          }
        }
    http_version: 
  recorded_at: Tue, 16 Dec 2014 20:18:31 GMT
- request:
    method: post
    uri: https://api:<MAILGUN_API_KEY>@api.mailgun.net/v2/epicodus.com/messages
    body:
      encoding: US-ASCII
      string: from=michael%40epicodus.com&to=student1%40example.com&bcc=michael%40epicodus.com&subject=Epicodus%20tuition%20payment%20receipt&text=Hi%20Example%20Brown%201.%20This%20is%20to%20confirm%20your%20payment%20of%20%245%2C000.00%20for%20Epicodus%20tuition.%20If%20you%20have%20any%20questions%2C%20reply%20to%20this%20email.%20Thanks!
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Content-Length:
      - '329'
      Content-Type:
      - application/x-www-form-urlencoded
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx/1.4.7
      Date:
      - Tue, 16 Dec 2014 20:18:31 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '88'
      Connection:
      - keep-alive
      Content-Disposition:
      - inline
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '600'
      Access-Control-Allow-Methods:
      - GET, POST, PUT, DELETE, OPTIONS
      Access-Control-Allow-Headers:
      - Content-Type, x-requested-with
    body:
      encoding: UTF-8
      string: |-
        {
          "message": "Queued. Thank you.",
          "id": "<20141216201831.92279.906@epicodus.com>"
        }
    http_version: 
  recorded_at: Tue, 16 Dec 2014 20:18:31 GMT
- request:
    method: post
    uri: https://api:<MAILGUN_API_KEY>@api.mailgun.net/v2/epicodus.com/messages
    body:
      encoding: US-ASCII
      string: from=michael%40epicodus.com&to=student1%40example.com&bcc=michael%40epicodus.com&subject=Epicodus%20payment%20failure%20notice&text=Hi%20Example%20Brown%201.%20This%20is%20to%20notify%20you%20that%20a%20recent%20payment%20you%20made%20for%20Epicodus%20tuition%20has%20failed.%20Please%20reply%20to%20this%20email%20so%20we%20can%20sort%20it%20out%20together.%20Thanks!
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Content-Length:
      - '368'
      Content-Type:
      - application/x-www-form-urlencoded
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx/1.4.7
      Date:
      - Tue, 16 Dec 2014 20:18:31 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '90'
      Connection:
      - keep-alive
      Content-Disposition:
      - inline
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '600'
      Access-Control-Allow-Methods:
      - GET, POST, PUT, DELETE, OPTIONS
      Access-Control-Allow-Headers:
      - Content-Type, x-requested-with
    body:
      encoding: UTF-8
      string: |-
        {
          "message": "Queued. Thank you.",
          "id": "<20141216201831.28226.91905@epicodus.com>"
        }
    http_version: 
  recorded_at: Tue, 16 Dec 2014 20:18:32 GMT
recorded_with: VCR 2.9.3
