spec/cassettes/Payment/make_a_payment/doesn_t_make_a_payment_with_a_bad_card.yml

---
http_interactions:
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/cards
    body:
      encoding: UTF-8
      string: '{"number":"4111111111111111","expiration_month":"12","expiration_year":"2020","cvv":"123"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Access-Control-Allow-Headers:
      - Content-Type
      Access-Control-Allow-Methods:
      - POST, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Content-Type:
      - application/json
      Date:
      - Tue, 21 Oct 2014 21:05:35 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMff439a82596511e4a45b02a1fe52a36c
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.31
      X-Midlr-Version:
      - '2'
      X-Newrelic-App-Data:
      - PxQFWFNXCQYTUllWAgAAU0YdFhE1AwE2QgNWEVlbQFtcCxYxSBVbDQoZVA4IF0pcXAgEEBhSVhQAQhhQEAMCFlVAFEIIFBQAHVUBWQVUAlNQAQdWX1cOBAhIQVAOCBtGRlRSBltTVQAJAwhaXFxRBldHFUFXAF8RAWs=
      Content-Length:
      - '1262'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "cards": [
            {
              "links": {
                "customer": null
              },
              "fingerprint": "b3ecb5551877e4c9ee9937f74cffbcfacc388e575cb4c061c30f8a32d340001b",
              "cvv_result": "Match",
              "number": "xxxxxxxxxxxx1111",
              "avs_postal_match": null,
              "expiration_month": 12,
              "meta": {},
              "id": "CCDI0JtetnCfQeCPVjTMDS",
              "category": "other",
              "type": "credit",
              "cvv_match": "yes",
              "bank_name": "JPMORGAN CHASE BANK, N.A.",
              "avs_street_match": null,
              "brand": "Visa",
              "updated_at": "2014-10-21T21:05:35.524323Z",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": true,
              "name": null,
              "expiration_year": 2020,
              "cvv": "xxx",
              "is_verified": true,
              "avs_result": null,
              "can_credit": false,
              "href": "/cards/CCDI0JtetnCfQeCPVjTMDS",
              "created_at": "2014-10-21T21:05:35.524319Z"
            }
          ],
          "links": {
            "cards.card_holds": "/cards/{cards.id}/card_holds",
            "cards.customer": "/customers/{cards.customer}",
            "cards.disputes": "/cards/{cards.id}/disputes",
            "cards.debits": "/cards/{cards.id}/debits"
          }
        }
    http_version: 
  recorded_at: Tue, 21 Oct 2014 21:05:38 GMT
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/cards
    body:
      encoding: UTF-8
      string: '{"number":"4444444444444448","expiration_month":"12","expiration_year":"2020","cvv":"123"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Access-Control-Allow-Headers:
      - Content-Type
      Access-Control-Allow-Methods:
      - POST, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Content-Type:
      - application/json
      Date:
      - Tue, 21 Oct 2014 21:05:36 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM00d5ca46596611e4803902a1fe53e539
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.31
      X-Midlr-Version:
      - '2'
      X-Newrelic-App-Data:
      - PxQFWFNXCQYTUllWAgAAU0YdFhE1AwE2QgNWEVlbQFtcCxYxSBVbDQoZVA4IF0pcXAgEEBhSVhQAQhhQEAMCFlVAFEIIFBQCHVEIVwNUAlNcBAJUUFINAQNQTUIFCA5KRBMHAlMFBlIGVFkHDAxQVABQG00RB1IOF1Nq
      Content-Length:
      - '1272'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "cards": [
            {
              "links": {
                "customer": null
              },
              "fingerprint": "9ea2b317b53183f5a93ba23a594a0b8a0f2183ea9cc338e0964755cd9df71b99",
              "cvv_result": "Match",
              "number": "xxxxxxxxxxxx4448",
              "avs_postal_match": null,
              "expiration_month": 12,
              "meta": {},
              "id": "CC2567RhgeVl9MWPY50ur8Q",
              "category": "other",
              "type": "credit",
              "cvv_match": "yes",
              "bank_name": "CREDIT AGRICOLE BANK POLSKA, S.A.",
              "avs_street_match": null,
              "brand": "Visa",
              "updated_at": "2014-10-21T21:05:36.806394Z",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": true,
              "name": null,
              "expiration_year": 2020,
              "cvv": "xxx",
              "is_verified": true,
              "avs_result": null,
              "can_credit": false,
              "href": "/cards/CC2567RhgeVl9MWPY50ur8Q",
              "created_at": "2014-10-21T21:05:36.806391Z"
            }
          ],
          "links": {
            "cards.card_holds": "/cards/{cards.id}/card_holds",
            "cards.customer": "/customers/{cards.customer}",
            "cards.disputes": "/cards/{cards.id}/disputes",
            "cards.debits": "/cards/{cards.id}/debits"
          }
        }
    http_version: 
  recorded_at: Tue, 21 Oct 2014 21:05:39 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/cards/CC2567RhgeVl9MWPY50ur8Q
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 21 Oct 2014 21:07:07 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM36e00912596611e4b84f0230f00c9248
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.31
      Content-Length:
      - '571'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "cards": [
            {
              "links": {
                "customer": null
              },
              "fingerprint": "9ea2b317b53183f5a93ba23a594a0b8a0f2183ea9cc338e0964755cd9df71b99",
              "cvv_result": "Match",
              "number": "xxxxxxxxxxxx4448",
              "avs_postal_match": null,
              "expiration_month": 12,
              "meta": {},
              "id": "CC2567RhgeVl9MWPY50ur8Q",
              "category": "other",
              "type": "credit",
              "cvv_match": "yes",
              "bank_name": "CREDIT AGRICOLE BANK POLSKA, S.A.",
              "avs_street_match": null,
              "brand": "Visa",
              "updated_at": "2014-10-21T21:05:36.806394Z",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": true,
              "name": null,
              "expiration_year": 2020,
              "cvv": "xxx",
              "is_verified": true,
              "avs_result": null,
              "can_credit": false,
              "href": "/cards/CC2567RhgeVl9MWPY50ur8Q",
              "created_at": "2014-10-21T21:05:36.806391Z"
            }
          ],
          "links": {
            "cards.card_holds": "/cards/{cards.id}/card_holds",
            "cards.customer": "/customers/{cards.customer}",
            "cards.disputes": "/cards/{cards.id}/disputes",
            "cards.debits": "/cards/{cards.id}/debits"
          }
        }
    http_version: 
  recorded_at: Tue, 21 Oct 2014 21:07:09 GMT
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/cards/CC2567RhgeVl9MWPY50ur8Q/debits
    body:
      encoding: UTF-8
      string: '{"amount":103,"appears_on_statement_as":"Epicodus tuition"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 402
      message: PAYMENT REQUIRED
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 21 Oct 2014 21:07:07 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM370aa1f4596611e484b40230f00c9248
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.31
      Content-Length:
      - '1472'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "errors": [
            {
              "status": "Payment Required",
              "category_code": "card-declined",
              "additional": "Account Frozen",
              "status_code": 402,
              "category_type": "banking",
              "extras": {},
              "request_id": "OHM370aa1f4596611e484b40230f00c9248",
              "description": "R758: Account Frozen. Your request id is OHM370aa1f4596611e484b40230f00c9248."
            }
          ],
          "links": {
            "debits.customer": "/customers/{debits.customer}",
            "debits.order": "/orders/{debits.order}",
            "debits.dispute": "/disputes/{debits.dispute}",
            "debits.source": "/resources/{debits.source}",
            "debits.events": "/debits/{debits.id}/events",
            "debits.refunds": "/debits/{debits.id}/refunds",
            "debits.card_hold": "/holds/{debits.card_hold}"
          },
          "debits": [
            {
              "status": "failed",
              "description": null,
              "links": {
                "customer": null,
                "source": "CC2567RhgeVl9MWPY50ur8Q",
                "card_hold": null,
                "order": null,
                "dispute": null
              },
              "updated_at": "2014-10-21T21:07:07.553323Z",
              "created_at": "2014-10-21T21:07:07.353858Z",
              "transaction_number": "WAYI-VH3-UQC5",
              "failure_reason": "R758: Account Frozen.",
              "currency": "USD",
              "amount": 103,
              "failure_reason_code": "card-declined",
              "meta": {},
              "href": "/debits/WD1FUlryAwWvPmhQSoy0edbn",
              "appears_on_statement_as": "BAL*Epicodus tuition",
              "id": "WD1FUlryAwWvPmhQSoy0edbn"
            }
          ]
        }
    http_version: 
  recorded_at: Tue, 21 Oct 2014 21:07:10 GMT
recorded_with: VCR 2.9.3
